In [1]:
import pandas as pd
import csv
import numpy as np
from geopy.geocoders import Nominatim
from geopy.distance import geodesic
from pyproj import Proj, transform

In [2]:
df_nonan = pd.read_csv("df_nonan.csv")

In [3]:
df_nonan.head()

,etablissement,id_groupe,division_groupe,discipline_poste,n_heures_class,id_matiere,grade_prof,discipline_recrutement,commune_domicile_prof,id_prof,secteur,latitude_school,longitude_school,latitude_prof,longitude_prof,distance_prof_est
0,0240001W,3A,D,L1800,1.0,90100,5512.0,1800A,24181.0,538.0,PU,44.764221,0.766679,44.748385,0.440531,36106.642647
1,0240001W,3A,D,L1700,1.0,81300,5531.0,1700E,24037.0,1654.0,PU,44.764221,0.766679,44.851653,0.471473,34062.153677
2,0240001W,3A,D,L0426,2.5,30602,5531.0,0426E,24140.0,8628.0,PU,44.764221,0.766679,44.840611,0.554938,24909.440638
3,0240001W,3A,D,L1300,3.0,61300,5531.0,1300E,24566.0,10176.0,PU,44.764221,0.766679,44.826831,0.686749,11255.365119
4,0240001W,3A,D,L1900,3.0,100100,5311.0,1900E,24037.0,10867.0,PU,44.764221,0.766679,44.851695,0.493106,31778.600158

In [13]:
df_nonan_prof = df_nonan[['id_prof','latitude_prof','longitude_prof']]
df_nonan_prof.columns = ['id', 'latitude', 'longitude']
df_nonan_prof2 = df_nonan_prof.drop_duplicates()
df_nonan_prof.head()

        id   latitude  longitude
0    538.0  44.748385   0.440531
1   1654.0  44.851653   0.471473
2   8628.0  44.840611   0.554938
3  10176.0  44.826831   0.686749
4  10867.0  44.851695   0.493106

In [14]:
len(df_nonan_prof2)

19895

In [15]:
df_nonan_prof2.to_csv('prof_coordinates.csv')

In [16]:
df_prof_coordinates = pd.read_csv("prof_coordinates.csv")

In [17]:
len(df_prof_coordinates)

19895

In [18]:
df_prof_coordinates.head()

   Unnamed: 0       id   latitude  longitude
0           0    538.0  44.748385   0.440531
1           1   1654.0  44.851653   0.471473
2           2   8628.0  44.840611   0.554938
3           3  10176.0  44.826831   0.686749
4           4  10867.0  44.851695   0.493106

In [19]:
df_prof_coordinates['type_of_entity'] = 0

In [20]:
df_prof_coordinates.head()

   Unnamed: 0       id   latitude  longitude  type_of_entity
0           0    538.0  44.748385   0.440531               0
1           1   1654.0  44.851653   0.471473               0
2           2   8628.0  44.840611   0.554938               0
3           3  10176.0  44.826831   0.686749               0
4           4  10867.0  44.851695   0.493106               0

In [21]:
len(df_prof_coordinates)

19895

In [22]:
df_schools_coordinates = df_nonan[['etablissement','latitude_school','longitude_school']]
df_schools_coordinates.columns = ['id', 'latitude', 'longitude']
df_schools_coordinates2 = df_schools_coordinates.drop_duplicates()
df_schools_coordinates2.head()

            id   latitude  longitude
0     0240001W  44.764221   0.766679
184   0240004Z  44.851854   0.488827
402   0240005A  44.857297   0.474161
1713  0240006B  44.853810   0.494293
2043  0240007C  44.843420   0.475149

In [23]:
len(df_schools_coordinates2)

546

In [24]:
df_schools_coordinates2['type_of_entity'] = 1

C:\Users\Leropc\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [25]:
df_schools_coordinates2.head()

            id   latitude  longitude  type_of_entity
0     0240001W  44.764221   0.766679               1
184   0240004Z  44.851854   0.488827               1
402   0240005A  44.857297   0.474161               1
1713  0240006B  44.853810   0.494293               1
2043  0240007C  44.843420   0.475149               1

In [26]:
df_coordinates_school_teachers = pd.concat([df_prof_coordinates,df_schools_coordinates2], axis=0)

C:\Users\Leropc\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [27]:
df_coordinates_school_teachers.head()

   Unnamed: 0     id   latitude  longitude  type_of_entity
0         0.0    538  44.748385   0.440531               0
1         1.0   1654  44.851653   0.471473               0
2         2.0   8628  44.840611   0.554938               0
3         3.0  10176  44.826831   0.686749               0
4         4.0  10867  44.851695   0.493106               0

In [28]:
df_coordinates_school_teachers.tail()

        Unnamed: 0        id   latitude  longitude  type_of_entity
187442         NaN  0642010M  43.358124  -0.793749               1
187489         NaN  0642011N  43.317070  -0.355441               1
187549         NaN  0642038T  43.472770  -1.442688               1
187983         NaN  0642095E  43.305363  -0.361226               1
188090         NaN  0642114A  43.498166  -1.457853               1

In [29]:
df_coordinates_school_teachers.to_csv('schools_teachers_coord.csv')